{"data":{"site":{"siteMetadata":{"title":"DerDrodt","author":"Daniel Drodt"}},"markdownRemark":{"id":"63987ea5-d46d-54b5-a254-9fcb74a6cfaf","excerpt":"In this series of blog posts, we will learn how and why and how to program, by looking at the two most popular wys of programming:  F…","html":"<p>In this series of blog posts, we will learn how and why and how to program, by looking at the two most popular wys of programming: <strong>F</strong>unctional and <strong>O</strong>bject <strong>O</strong>riented <strong>P</strong>rogramming. We’ll both look at the theory behind it and write actual code.</p>\n<p>The languages we will look at, are <em>Racket</em> (or rather HtDP-TL) on the functional side and Java on the OOP side.</p>\n<h2>What is a Program?</h2>\n<p>A program is a series of commands we write for a computer to execute. Everything you do on your computer and smartphone is a program and works, because the computer can understand it. But since computers only understand instructions written in 1s and 0s, but humans don’t, we created special languages to write programs we can read and we can transform to something computers can understand. This transformation of our <em>source code</em> written in a programming language to <em>byte code</em> is called compiling. We have to compile most languages, like Java and C. These are called compiled languages, fittingly enough. Other languages like JavaScript, Ruby or Racket do not have to be compiled and are just run by another program directly, they are interpreted languages.</p>\n<p>Every programming language is unique and has a very specific way of solving problems. A lot are specialized for specific problems, like vector and matrix calculations, while others like Java are general purpose languages. There are <strong>a lot</strong> of programing languages. While there are roughly <a href=\"6,500%20spoken%20languages%20in%20the%20world%20today\">https://www.infoplease.com/askeds/how-many-spoken-languages</a>.</p>","timeToRead":1,"frontmatter":{"date":"02 December 2018","title":"Introduction to FOOP","topic":"FOOP"}}},"pageContext":{"slug":"/foop/foop-intro/","topic":"FOOP","previous":null,"next":{"fields":{"slug":"/foop/racket-intro/"},"frontmatter":{"title":"Introduction to Racket","topic":"FOOP"}},"previousInTopic":null,"nextInTopic":{"fields":{"slug":"/foop/racket-intro/"},"frontmatter":{"title":"Introduction to Racket","topic":"FOOP"}}}}